; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport three-cities-sequential-3nodes-1000size-3degree-100mindistance-6trucks-4packages-854seed

(define (problem transport-three-cities-sequential-3nodes-1000size-3degree-100mindistance-6trucks-4packages-854seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-3-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-3-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-3-loc-3 - location
  truck-1 - vehicle
  truck-2 - vehicle
  truck-3 - vehicle
  truck-4 - vehicle
  truck-5 - vehicle
  truck-6 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 742,807 -> 938,774
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 20)
  ; 938,774 -> 742,807
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 20)
  ; 742,807 -> 362,343
  (road city-1-loc-3 city-1-loc-2)
  (= (road-length city-1-loc-3 city-1-loc-2) 60)
  ; 362,343 -> 742,807
  (road city-1-loc-2 city-1-loc-3)
  (= (road-length city-1-loc-2 city-1-loc-3) 60)
  ; 2608,489 -> 2512,570
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 13)
  ; 2512,570 -> 2608,489
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 13)
  ; 2605,625 -> 2512,570
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 11)
  ; 2512,570 -> 2605,625
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 11)
  ; 2605,625 -> 2608,489
  (road city-2-loc-3 city-2-loc-2)
  (= (road-length city-2-loc-3 city-2-loc-2) 14)
  ; 2608,489 -> 2605,625
  (road city-2-loc-2 city-2-loc-3)
  (= (road-length city-2-loc-2 city-2-loc-3) 14)
  ; 1243,2389 -> 1462,2039
  (road city-3-loc-3 city-3-loc-1)
  (= (road-length city-3-loc-3 city-3-loc-1) 42)
  ; 1462,2039 -> 1243,2389
  (road city-3-loc-1 city-3-loc-3)
  (= (road-length city-3-loc-1 city-3-loc-3) 42)
  ; 1243,2389 -> 1692,2826
  (road city-3-loc-3 city-3-loc-2)
  (= (road-length city-3-loc-3 city-3-loc-2) 63)
  ; 1692,2826 -> 1243,2389
  (road city-3-loc-2 city-3-loc-3)
  (= (road-length city-3-loc-2 city-3-loc-3) 63)
  ; 938,774 <-> 2512,570
  (road city-1-loc-1 city-2-loc-1)
  (= (road-length city-1-loc-1 city-2-loc-1) 159)
  (road city-2-loc-1 city-1-loc-1)
  (= (road-length city-2-loc-1 city-1-loc-1) 159)
  (road city-1-loc-1 city-3-loc-1)
  (= (road-length city-1-loc-1 city-3-loc-1) 159)
  (road city-3-loc-1 city-1-loc-1)
  (= (road-length city-3-loc-1 city-1-loc-1) 159)
  (road city-2-loc-1 city-3-loc-1)
  (= (road-length city-2-loc-1 city-3-loc-1) 159)
  (road city-3-loc-1 city-2-loc-1)
  (= (road-length city-3-loc-1 city-2-loc-1) 159)
  (at package-1 city-3-loc-1)
  (at package-2 city-2-loc-1)
  (at package-3 city-1-loc-2)
  (at package-4 city-1-loc-3)
  (at truck-1 city-1-loc-1)
  (capacity truck-1 capacity-2)
  (at truck-2 city-3-loc-1)
  (capacity truck-2 capacity-4)
  (at truck-3 city-2-loc-1)
  (capacity truck-3 capacity-3)
  (at truck-4 city-2-loc-1)
  (capacity truck-4 capacity-4)
  (at truck-5 city-1-loc-2)
  (capacity truck-5 capacity-3)
  (at truck-6 city-2-loc-1)
  (capacity truck-6 capacity-4)
 )
 (:goal (and
  (at package-1 city-1-loc-3)
  (at package-2 city-1-loc-2)
  (at package-3 city-3-loc-3)
  (at package-4 city-2-loc-3)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (pick-up truck-5 city-1-loc-2 package-3 capacity-2 capacity-3)
   deleted: (at package-3 city-1-loc-2) (capacity truck-5 capacity-3)
   added: (in package-3 truck-5) (capacity truck-5 capacity-2)
   goals met: 0 of 4
2. (drive truck-5 city-1-loc-2 city-1-loc-3)
   deleted: (at truck-5 city-1-loc-2)
   added: (at truck-5 city-1-loc-3)
   goals met: 0 of 4
3. (pick-up truck-5 city-1-loc-3 package-4 capacity-1 capacity-2)
   deleted: (at package-4 city-1-loc-3) (capacity truck-5 capacity-2)
   added: (in package-4 truck-5) (capacity truck-5 capacity-1)
   goals met: 0 of 4
4. (pick-up truck-2 city-3-loc-1 package-1 capacity-3 capacity-4)
   deleted: (at package-1 city-3-loc-1) (capacity truck-2 capacity-4)
   added: (in package-1 truck-2) (capacity truck-2 capacity-3)
   goals met: 0 of 4
5. (drive truck-2 city-3-loc-1 city-2-loc-1)
   deleted: (at truck-2 city-3-loc-1)
   added: (at truck-2 city-2-loc-1)
   goals met: 0 of 4
6. (pick-up truck-2 city-2-loc-1 package-2 capacity-2 capacity-3)
   deleted: (at package-2 city-2-loc-1) (capacity truck-2 capacity-3)
   added: (in package-2 truck-2) (capacity truck-2 capacity-2)
   goals met: 0 of 4
7. (drive truck-5 city-1-loc-3 city-1-loc-1)
   deleted: (at truck-5 city-1-loc-3)
   added: (at truck-5 city-1-loc-1)
   goals met: 0 of 4
8. (drive truck-5 city-1-loc-1 city-2-loc-1)
   deleted: (at truck-5 city-1-loc-1)
   added: (at truck-5 city-2-loc-1)
   goals met: 0 of 4
9. (drive truck-5 city-2-loc-1 city-2-loc-3)
   deleted: (at truck-5 city-2-loc-1)
   added: (at truck-5 city-2-loc-3)
   goals met: 0 of 4
10. (drop truck-5 city-2-loc-3 package-4 capacity-1 capacity-2)
   deleted: (in package-4 truck-5) (capacity truck-5 capacity-1)
   added: (at package-4 city-2-loc-3) (capacity truck-5 capacity-2)
   goals met: 1 of 4
11. (drive truck-5 city-2-loc-3 city-2-loc-1)
   deleted: (at truck-5 city-2-loc-3)
   added: (at truck-5 city-2-loc-1)
   goals met: 1 of 4
12. (drive truck-2 city-2-loc-1 city-1-loc-1)
   deleted: (at truck-2 city-2-loc-1)
   added: (at truck-2 city-1-loc-1)
   goals met: 1 of 4
13. (drive truck-2 city-1-loc-1 city-1-loc-3)
   deleted: (at truck-2 city-1-loc-1)
   added: (at truck-2 city-1-loc-3)
   goals met: 1 of 4
14. (drive truck-5 city-2-loc-1 city-3-loc-1)
   deleted: (at truck-5 city-2-loc-1)
   added: (at truck-5 city-3-loc-1)
   goals met: 1 of 4
15. (drive truck-5 city-3-loc-1 city-3-loc-3)
   deleted: (at truck-5 city-3-loc-1)
   added: (at truck-5 city-3-loc-3)
   goals met: 1 of 4
16. (drop truck-2 city-1-loc-3 package-1 capacity-2 capacity-3)
   deleted: (in package-1 truck-2) (capacity truck-2 capacity-2)
   added: (at package-1 city-1-loc-3) (capacity truck-2 capacity-3)
   goals met: 2 of 4
17. (drive truck-2 city-1-loc-3 city-1-loc-2)
   deleted: (at truck-2 city-1-loc-3)
   added: (at truck-2 city-1-loc-2)
   goals met: 2 of 4
18. (drop truck-2 city-1-loc-2 package-2 capacity-3 capacity-4)
   deleted: (in package-2 truck-2) (capacity truck-2 capacity-3)
   added: (at package-2 city-1-loc-2) (capacity truck-2 capacity-4)
   goals met: 3 of 4
19. (drop truck-5 city-3-loc-3 package-3 capacity-2 capacity-3)
   deleted: (in package-3 truck-5) (capacity truck-5 capacity-2)
   added: (at package-3 city-3-loc-3) (capacity truck-5 capacity-3)
   goals met: 4 of 4
